src/БиблиотекаИнструментовРазработки/src/InformationRegisters/бир_События/бир_События.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бир_События</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Момент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Событие</name>
    <type>
      <types>CatalogRef.бир_События</types>
    </type>
  </resources>
  <resources>
    <name>ИдПервичный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипИсточника</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      <types>CatalogRef.ИдентификаторыОбъектовРасширений</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Параметры</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РезультатПроверки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Ид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаВозникновения</name>
    <type>
      <types>CatalogRef.бир_СобытияТочкиВозникновения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>ExchangePlanRef</types>
      <types>BusinessProcessRoutePointRef</types>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>ChartOfCalculationTypesRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>ChartOfAccountsRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/БиблиотекаИнструментовРазработки/src/InformationRegisters/бир_СобытияОбработка/бир_СобытияОбработка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бир_СобытияОбработка</name>
  <resources>
    <name>Событие</name>
    <type>
      <types>CatalogRef.бир_События</types>
    </type>
  </resources>
  <resources>
    <name>РучнаяОбработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РезультатОбработки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Ид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаВозникновения</name>
    <type>
      <types>CatalogRef.бир_СобытияТочкиВозникновения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Обработчик</name>
    <type>
      <types>CatalogRef.бир_СобытияОбработчики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/БиблиотекаИнструментовРазработки/src/Catalogs/бир_СобытияТочкиВозникновения/бир_СобытияТочкиВозникновения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бир_СобытияТочкиВозникновения</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ЭтаИБ</name>
      <description>Эта ИБ</description>
    </items>
  </predefined>
  <attributes>
    <name>Ид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СервисСобытий_Адрес</name>
    <type>
      <types>CatalogRef.бир_АдресаСервисов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/БиблиотекаИнструментовРазработки/src/InformationRegisters/бир_События/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекДатаУ = ТекущаяУниверсальнаяДата();
	ТекДата = МестноеВремя(ТекДатаУ, ЧасовойПоясСеанса());
	
	СмещениеВремени = Цел((ТекДата - ТекДатаУ) / 60);
	
	Список.Параметры.УстановитьЗначениеПараметра("СмещениеВремени", СмещениеВремени);

	Обработка.Параметры.УстановитьЗначениеПараметра("ТочкаВозникновения", Справочники.бир_СобытияТочкиВозникновения.ЭтаИБ);
	Обработка.Параметры.УстановитьЗначениеПараметра("Ид"				, "");
	
	ОбработкаКлиент.Параметры.УстановитьЗначениеПараметра("ТочкаВозникновения"	, Справочники.бир_СобытияТочкиВозникновения.ЭтаИБ);
	ОбработкаКлиент.Параметры.УстановитьЗначениеПараметра("Ид"					, "");
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Для Каждого ТекФиксЭлемент Из Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы  Цикл
        
		ЭлементОтбора = Неопределено;
		Для Каждого ТекЭлемент Из Список.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если ТекЭлемент.ЛевоеЗначение = ТекФиксЭлемент.ЛевоеЗначение Тогда
				ЭлементОтбора = ТекЭлемент;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЭлементОтбора = Неопределено Тогда
			ЭлементОтбора = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	        ЭлементОтбора.ЛевоеЗначение = ТекФиксЭлемент.ЛевоеЗначение;
	        ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		КонецЕсли;
        ЭлементОтбора.ВидСравнения = ТекФиксЭлемент.ВидСравнения;
        ЭлементОтбора.ПравоеЗначение = ТекФиксЭлемент.ПравоеЗначение;
        ЭлементОтбора.Использование = ТекФиксЭлемент.Использование;  
        ЭлементОтбора.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор();
        
    КонецЦикла;  
    
    Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
	
КонецПроцедуры // ПриОткрытии()

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбновитьИнформациюОбОбработкеСобытия", 0.3, Истина);
	
КонецПроцедуры // СписокПриАктивизацииСтроки()

&НаКлиенте
Процедура ОбновитьИнформациюОбОбработкеСобытия()
	
	ТекТочкаВозникновения = Неопределено;
	ТекИд                 = "";
	ТекОшибка             = Ложь;
	РезультатПроверки     = "";
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ТекТочкаВозникновения = ТекущиеДанные.ТочкаВозникновения;
		ТекИд                 = ТекущиеДанные.Ид;
		ТекОшибка             = ТекущиеДанные.Ошибка;
		РезультатПроверки     = ТекущиеДанные.РезультатПроверки;
	КонецЕсли;
	
	ОбновитьИнформациюОбОбработкеСобытияСервер(ТекТочкаВозникновения, ТекИд);
	
	Элементы.ГруппаРезультатПроверки.Видимость = ЗначениеЗаполнено(РезультатПроверки);
	
	Если ТекОшибка Тогда 
		Элементы.ГруппаРезультатПроверки.Заголовок = "Ошибка проверки";
		Элементы.ГруппаОбработка.ТекущаяСтраница = Элементы.ГруппаРезультатПроверки;
	Иначе
		Элементы.ГруппаРезультатПроверки.Заголовок = "Результат проверки";
		Элементы.ГруппаОбработка.ТекущаяСтраница = Элементы.ГруппаОбработкаСервер;
	КонецЕсли;

КонецПроцедуры // ОбновитьИнформациюОбОбработкеСобытия()

&НаСервере
Процедура ОбновитьИнформациюОбОбработкеСобытияСервер(ТочкаВозникновения, Ид)
	
	Обработка.Параметры.УстановитьЗначениеПараметра("ТочкаВозникновения", ТочкаВозникновения);
	Обработка.Параметры.УстановитьЗначениеПараметра("Ид"				, Ид);
	
	ОбработкаКлиент.Параметры.УстановитьЗначениеПараметра("ТочкаВозникновения"	, ТочкаВозникновения);
	ОбработкаКлиент.Параметры.УстановитьЗначениеПараметра("Ид"					, Ид);
	
КонецПроцедуры // ОбновитьИнформациюОбОбработкеСобытияСервер()

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормыСписок

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьОбработчикиСобытий(Команда)
	
	ВыполнитьОбработчикиСобытийНаСервере();
	
	Элементы.Список.Обновить();
	Элементы.Обработка.Обновить();
	Элементы.ОбработкаКлиент.Обновить();
	
КонецПроцедуры // ВыполнитьОбработчикиСобытий()

&НаСервере
Процедура ВыполнитьОбработчикиСобытийНаСервере()
	
	Для Каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		ВыполнитьОбработчикиСобытияНаСервере(ТекущаяСтрока.Ид);
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьОбработчикиСобытийНаСервере()

&НаСервереБезКонтекста
Процедура ВыполнитьОбработчикиСобытияНаСервере(Ид, Успешные = Ложь, СОшибками = Истина)
	
	ПреобразованиеДанных = Обработки.бир_ПреобразованиеДанных.Создать();
	
	ЗапросОбработчиков = Новый Запрос("ВЫБРАТЬ
	                                  |	События.ТочкаВозникновения КАК ТочкаВозникновения,
	                                  |	События.Ид КАК Ид,
	                                  |	События.Дата КАК Дата,
	                                  |	События.Момент КАК Момент,
	                                  |	События.Событие КАК Событие,
	                                  |	События.Источник КАК Источник,
	                                  |	События.Параметры КАК Параметры,
	                                  |	СобытияОбработка.Обработчик КАК Обработчик
	                                  |ИЗ
	                                  |	РегистрСведений.бир_События КАК События
	                                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бир_СобытияОбработка КАК СобытияОбработка
	                                  |		ПО События.Ид = СобытияОбработка.Ид
	                                  |ГДЕ
	                                  |	События.Ид = &Ид
	                                  |	И (НЕ СобытияОбработка.Обработано
	                                  |			ИЛИ &Успешные
	                                  |				И СобытияОбработка.Обработано
	                                  |			ИЛИ &СОшибками
	                                  |				И СобытияОбработка.Ошибка)");
	
	ЗапросОбработчиков.УстановитьПараметр("Ид"       , Ид);
	ЗапросОбработчиков.УстановитьПараметр("Успешные" , Успешные);
	ЗапросОбработчиков.УстановитьПараметр("СОшибками", СОшибками);
	
	Результат = ЗапросОбработчиков.Выполнить();
	
	ВыборкаОбработчиков = Результат.Выбрать();
	
	Пока ВыборкаОбработчиков.Следующий() Цикл
		
		ОписаниеСобытия = бир_События.СтруктураОписанияСобытия(ВыборкаОбработчиков.ТочкаВозникновения,
		                                                       ВыборкаОбработчиков.Ид,
		                                                       ВыборкаОбработчиков.Источник,
		                                                       ВыборкаОбработчиков.Событие,
		                                                       ВыборкаОбработчиков.Дата,
		                                                       ВыборкаОбработчиков.Момент);
		
		ПараметрыСобытия = ПреобразованиеДанных.ПрочитатьОписаниеОбъектаИзJSON(ВыборкаОбработчиков.Параметры);
		ПараметрыСобытия = ПреобразованиеДанных.ЗначениеИзСтруктуры(ПараметрыСобытия, Истина, Ложь);
		
		бир_События.ВыполнитьОбработчикСобытия(ОписаниеСобытия,
		                                       ВыборкаОбработчиков.Обработчик,
		                                       ПараметрыСобытия);
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьОбработчикиСобытияНаСервере()

#КонецОбласти // ОбработчикиКомандФормы
